ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/device/TMPM46B.h
/**
 *******************************************************************************
 * @file    TMPM46B.h
 * @brief   CMSIS Cortex-M4 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM46B' Device Series
 * @version V2.0.2.4 (Tentative)
 * @date    2015/03/13
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
* (C)Copyright TOSHIBA ELECTRONIC DEVICES & STORAGE CORPORATION 2017 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX04_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM46B
  * @{
  */

#ifndef __TMPM46B_H__
#define __TMPM46B_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M4 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M4 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M4 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M4 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M4 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M4 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M4 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M4 System Tick Interrupt                          */

/******  TMPM46B Specific Interrupt Numbers *******************************************************************/
  INT0_IRQn                     = 0,         /*!< Interrupt pin 0                                             */
  INT1_IRQn                     = 1,         /*!< Interrupt pin 1                                             */
  INT2_IRQn                     = 2,         /*!< Interrupt pin 2                                             */
  INT3_IRQn                     = 3,         /*!< Interrupt pin 3                                             */
  INT4_IRQn                     = 4,         /*!< Interrupt pin 4                                             */
  INT5_IRQn                     = 5,         /*!< Interrupt pin 5                                             */
  INT6_IRQn                     = 6,         /*!< Interrupt pin 6                                             */
  INT7_IRQn                     = 7,         /*!< Interrupt pin 7                                             */
  INT8_IRQn                     = 8,         /*!< Interrupt pin 8                                             */
  INT9_IRQn                     = 9,         /*!< Interrupt pin 9                                             */
  INTA_IRQn                     = 10,        /*!< Interrupt pin A                                             */
  INTB_IRQn                     = 11,        /*!< Interrupt pin B                                             */
  INTC_IRQn                     = 12,        /*!< Interrupt pin C                                             */
  INTD_IRQn                     = 13,        /*!< Interrupt pin D                                             */
  INTE_IRQn                     = 14,        /*!< Interrupt pin E                                             */
  INTF_IRQn                     = 15,        /*!< Interrupt pin F                                             */
  INTRX0_IRQn                   = 16,        /*!< Serial0 reception interrupt                                 */
  INTTX0_IRQn                   = 17,        /*!< Serial0 transmission interrupt                              */
  INTRX1_IRQn                   = 18,        /*!< Serial1 reception interrupt                                 */
  INTTX1_IRQn                   = 19,        /*!< Serial1 transmission interrupt                              */
  INTRX2_IRQn                   = 20,        /*!< Serial2 reception interrupt                                 */
  INTTX2_IRQn                   = 21,        /*!< Serial2 transmission interrupt                              */
  INTRX3_IRQn                   = 22,        /*!< Serial3 reception interrupt                                 */
  INTTX3_IRQn                   = 23,        /*!< Serial3 transmission interrupt                              */
  INTUART0_IRQn                 = 24,        /*!< Full UART0 transmission and reception interrupt             */
  INTUART1_IRQn                 = 25,        /*!< Full UART1 transmission and reception interrupt             */
  INTI2C0_IRQn                  = 26,        /*!< I2C0 transmission and reception interrupt                   */
  INTI2C1_IRQn                  = 27,        /*!< I2C1 transmission and reception interrupt                   */
  INTI2C2_IRQn                  = 28,        /*!< I2C2 transmission and reception interrupt                   */
  INTSSP0_IRQn                  = 29,        /*!< SSP(SPI) Serial interface 0 interrupt                       */
  INTSSP1_IRQn                  = 30,        /*!< SSP(SPI) Serial interface 1 interrupt                       */
  INTSSP2_IRQn                  = 31,        /*!< SSP(SPI) Serial interface 2 interrupt                       */
  INTADHP_IRQn                  = 32,        /*!< High Priority AD conversion interrupt                       */
  INTADM0_IRQn                  = 33,        /*!< AD conversion monitor interrupt 0                           */
  INTADM1_IRQn                  = 34,        /*!< AD conversion monitor interrupt 1                           */
  INTAD_IRQn                    = 35,        /*!< AD conversion interrupt                                     */
  INTAES_IRQn                   = 36,        /*!< AES completion interrupt                                    */
  INTSHA_IRQn                   = 37,        /*!< SHA completion interrupt                                    */
  INTMLA_IRQn                   = 38,        /*!< MLA completion interrupt                                    */
  INTESG_IRQn                   = 39,        /*!< ESG completion interrupt                                    */
  INTSNFCSEQ_IRQn               = 40,        /*!< SNFC command sequence end interrupt                         */
  INTSNFCPRTAE_IRQn             = 41,        /*!< SNFC page lead RAM transfer end interrupt                   */
  INTSNFCPRTCE_IRQn             = 42,        /*!< SNFC decode data RAM transmission end interrupt             */
  INTSNFCFAIL_IRQn              = 43,        /*!< SNFC decode fail interrupt                                  */
  INTMTEMG0_IRQn                = 47,        /*!< MPT0 EMG interrupt                                          */
  INTMTPTB00_IRQn               = 48,        /*!< MPT0 compare match0/overflow,IGBT cycle interrupt           */
  INTMTPTB01_IRQn               = 49,        /*!< MPT0 compare match1/overflow,IGBT cycle interrupt           */
  INTMTCAP00_IRQn               = 50,        /*!< MPT0 input capture0 interrupt                               */
  INTMTCAP01_IRQn               = 51,        /*!< MPT0 input capture1 interrupt                               */
  INTMTEMG1_IRQn                = 52,        /*!< MPT1 EMG interrupt                                          */
  INTMTPTB10_IRQn               = 53,        /*!< MPT1 compare match0/overflow,IGBT cycle interrupt           */
  INTMTPTB11_IRQn               = 54,        /*!< MPT1 compare match1/overflow,IGBT cycle interrupt           */
  INTMTCAP10_IRQn               = 55,        /*!< MPT1 input capture0 interrupt                               */
  INTMTCAP11_IRQn               = 56,        /*!< MPT1 input capture1 interrupt                               */
  INTMTEMG2_IRQn                = 57,        /*!< MPT2 EMG interrupt                                          */
  INTMTPTB20_IRQn               = 58,        /*!< MPT2 compare match0/overflow,IGBT cycle interrupt           */
  INTMTTTB21_IRQn               = 59,        /*!< MPT2 compare match1/overflow,IGBT cycle interrupt           */
  INTMTCAP20_IRQn               = 60,        /*!< MPT2 input capture0 interrupt                               */
  INTMTCAP21_IRQn               = 61,        /*!< MPT2 input capture1 interrupt                               */
  INTMTEMG3_IRQn                = 62,        /*!< MPT3 EMG interrupt                                          */
  INTMTPTB30_IRQn               = 63,        /*!< MPT3 compare match0/overflow,IGBT cycle interrupt           */
  INTMTTTB31_IRQn               = 64,        /*!< MPT3 compare match1/overflow,IGBT cycle interrupt           */
  INTMTCAP30_IRQn               = 65,        /*!< MPT3 input capture0 interrupt                               */
  INTMTCAP31_IRQn               = 66,        /*!< MPT3 input capture1 interrupt                               */
  INTTB0_IRQn                   = 67,        /*!< TMRB0 compare match detection interrupt                     */
  INTCAP00_IRQn                 = 68,        /*!< TMRB0 input capture 0 interrupt                             */
  INTCAP01_IRQn                 = 69,        /*!< TMRB0 input capture 1 interrupt                             */
  INTTB1_IRQn                   = 70,        /*!< TMRB1 compare match detection interrupt                     */
  INTCAP10_IRQn                 = 71,        /*!< TMRB1 input capture 0 interrupt                             */
  INTCAP11_IRQn                 = 72,        /*!< TMRB1 input capture 1 interrupt                             */
  INTTB2_IRQn                   = 73,        /*!< TMRB2 compare match detection interrupt                     */
  INTCAP20_IRQn                 = 74,        /*!< TMRB2 input capture 0 interrupt                             */
  INTCAP21_IRQn                 = 75,        /*!< TMRB2 input capture 1 interrupt                             */
  INTTB3_IRQn                   = 76,        /*!< TMRB3 compare match detection interrupt                     */
  INTCAP30_IRQn                 = 77,        /*!< TMRB3 input capture 0 interrupt                             */
  INTCAP31_IRQn                 = 78,        /*!< TMRB3 input capture 1 interrupt                             */
  INTTB4_IRQn                   = 79,        /*!< TMRB4 compare match detection interrupt                     */
  INTCAP40_IRQn                 = 80,        /*!< TMRB4 input capture 0 interrupt                             */
  INTCAP41_IRQn                 = 81,        /*!< TMRB4 input capture 1 interrupt                             */
  INTTB5_IRQn                   = 82,        /*!< TMRB5 compare match detection interrupt                     */
  INTCAP50_IRQn                 = 83,        /*!< TMRB5 input capture 0 interrupt                             */
  INTCAP51_IRQn                 = 84,        /*!< TMRB5 input capture 1 interrupt                             */
  INTTB6_IRQn                   = 85,        /*!< TMRB6 compare match detection interrupt                     */
  INTCAP60_IRQn                 = 86,        /*!< TMRB6 input capture 0 interrupt                             */
  INTCAP61_IRQn                 = 87,        /*!< TMRB6 input capture 1 interrupt                             */
  INTTB7_IRQn                   = 88,        /*!< TMRB7 compare match detection interrupt                     */
  INTCAP70_IRQn                 = 89,        /*!< TMRB7 input capture 0 interrupt                             */
  INTCAP71_IRQn                 = 90,        /*!< TMRB7 input capture 1 interrupt                             */
  INTRTC_IRQn                   = 91,        /*!< Real time clock interrupt                                   */
  INTDMAA_IRQn                  = 92,        /*!< DMAC unitA transmission completion interrupt(ch4-31)        */
  INTDMAB_IRQn                  = 93,        /*!< DMAC unitB transmission completion interrupt(ch24-31)       */
  INTDMAC_IRQn                  = 94,        /*!< DMAC unitC transmission completion interrupt(ch12-31)       */
  INTDMACTC8_IRQn               = 95,        /*!< DMAC unitC transmission completion interrupt(ch8)           */
  INTDMACTC9_IRQn               = 96,        /*!< DMAC unitC transmission completion interrupt(ch9)           */
  INTDMACTC10_IRQn              = 97,        /*!< DMAC unitC transmission completion interrupt(ch10)          */
  INTDMACTC11_IRQn              = 98,        /*!< DMAC unitC transmission completion interrupt(ch11)          */
  INTDMAAERR_IRQn               = 99,        /*!< DMAC transmission error interrupt(unitA)                    */
  INTDMABERR_IRQn               = 100,       /*!< DMAC transmission error interrupt(unitB)                    */
  INTDMACERR_IRQn               = 101,       /*!< DMAC transmission error interrupt(unitC)                    */
  INTFLRDY_IRQn                 = 102        /*!< Flash Ready interrupt                                       */
} IRQn_Type;

