ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/device/TMPM46B.h
/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M4 Processor and Core Peripherals */
#define __CM4_REV              0x0001       /*!< Cortex-M4 Core Revision                           */
#define __MPU_PRESENT             0         /*!< MPU present or not                                */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels           */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used      */
#define __FPU_PRESENT							1					/*!< FPU present or not                                */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm4.h"                       /* Cortex-M4 processor and core peripherals            */
#include "system_TMPM46B.h"                 /* TMPM46B System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

/**
  * @brief Synchronous Serial Port
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< SSP Control Register 0                       */
  __IO uint32_t CR1;               /*!< SSP Control Register 1                       */
  __IO uint32_t DR;                /*!< SSP Data Register                            */
  __I  uint32_t SR;                /*!< SSP Status Register                          */
  __IO uint32_t CPSR;              /*!< SSP Clock Prescaler Register                 */
  __IO uint32_t IMSC;              /*!< SSP Interrupt Mask Set and Clear Register    */
  __I  uint32_t RIS;               /*!< SSP Raw Interrupt Status Register            */
  __I  uint32_t MIS;               /*!< SSP Masked Interrupt Status Register         */
  __O  uint32_t ICR;               /*!< SSP Interrupt Clear Register                 */
  __IO uint32_t DMACR;             /*!< SSP DMA Control Register                     */
} TSB_SSP_TypeDef;

#if defined ( __CC_ARM   )           /* RealView Compiler */
#pragma anon_unions
#elif (defined (__ICCARM__))         /*  ICC Compiler     */
#pragma language=extended
#endif

/**
  * @brief UART
  */
typedef struct
{
  __IO uint32_t DR;                /*!< Data Register                                */
union {
  __I  uint32_t RSR;               /*!< Receive Status Register                      */
  __O  uint32_t ECR;               /*!< Error Clear Register                         */
  };
       uint32_t RESERVED0[4];
  __I  uint32_t FR;                /*!< Flag Register                                */
       uint32_t RESERVED1;
  __IO uint32_t ILPR;              /*!< UART IrDA lowPower count register            */
  __IO uint32_t IBRD;              /*!< Integer Baud Rate Register                   */
  __IO uint32_t FBRD;              /*!< Fractional Baud Rate Register                */
  __IO uint32_t LCR_H;             /*!< Line Control Register                        */
  __IO uint32_t CR;                /*!< Control Register                             */
  __IO uint32_t IFLS;              /*!< Interrupt FIFO Level Selection Register      */
  __IO uint32_t IMSC;              /*!< Interrupt Mask Set/Clear Register            */
  __I  uint32_t RIS;               /*!< Raw Interrupt Status Register                */
  __I  uint32_t MIS;               /*!< Masked Interrupt Status Register             */
  __O  uint32_t ICR;               /*!< Interrupt Clear Register                     */
  __IO uint32_t DMACR;             /*!< DMA Control Register                         */
} TSB_UART_TypeDef;

/**
  * @brief DMA Controller
  */
typedef struct
{
  __I  uint32_t STATUS;            /*!< DMA Status Register                          */
  __O  uint32_t CFG;               /*!< DMA Configuration Register                   */
  __IO uint32_t CTRLBASEPTR;       /*!< DMA Control Data Base Pointer Register       */
  __I  uint32_t ALTCTRLBASEPTR;    /*!< DMA Channel Alternate Control Data Base Pointer Register*/
       uint32_t RESERVED0;
  __O  uint32_t CHNLSWREQUEST;     /*!< DMA Channel Software Request Register        */
  __IO uint32_t CHNLUSEBURSTSET;   /*!< DMA Channel Useburst Set Register            */
  __O  uint32_t CHNLUSEBURSTCLR;   /*!< DMA Channel Useburst Clear Register          */
  __IO uint32_t CHNLREQMASKSET;    /*!< DMA Channel Request Mask Set Register        */
  __O  uint32_t CHNLREQMASKCLR;    /*!< DMA Channel Request Mask Clear Register      */
  __IO uint32_t CHNLENABLESET;     /*!< DMA Channel Enable Set Register              */
  __O  uint32_t CHNLENABLECLR;     /*!< DMA Channel Enable Clear Register            */
  __IO uint32_t CHNLPRIALTSET;     /*!< DMA Channel Primary-Alternate Set Register   */
  __O  uint32_t CHNLPRIALTCLR;     /*!< DMA Channel Primary-Alternate Clear Register */
  __IO uint32_t CHNLPRIORITYSET;   /*!< DMA Channel Priority Set Register            */
  __O  uint32_t CHNLPRIORITYCLR;   /*!< DMA Channel Priority Clear Register          */
       uint32_t RESERVED1[3];
  __IO uint32_t ERRCLR;            /*!< DMA Bus Error Clear Register                 */
} TSB_DMA_TypeDef;

/**
  * @brief 12bit A/D Converter
  */
typedef struct
{
  __IO uint32_t CLK;               /*!< Conversion Clock Setting Register            */
  __O  uint32_t MOD0;              /*!< Mode Control Register0                       */
  __IO uint32_t MOD1;              /*!< Mode Control Register1                       */
  __IO uint32_t MOD2;              /*!< Mode Control Register2                       */
  __IO uint32_t MOD3;              /*!< Mode Control Register3                       */
  __IO uint32_t MOD4;              /*!< Mode Control Register4                       */
  __I  uint32_t MOD5;              /*!< Mode Control Register5                       */
  __O  uint32_t MOD6;              /*!< Mode Control Register6                       */
       uint32_t RESERVED0;
  __IO uint32_t CMPCR0;            /*!< Monitoring Interrupt Control Register0       */
  __IO uint32_t CMPCR1;            /*!< Monitoring Interrupt Control Register1       */
  __IO uint32_t CMP0;              /*!< Conversion Result Compare Register0          */
  __IO uint32_t CMP1;              /*!< Conversion Result Compare Register1          */
  __I  uint32_t REG00;             /*!< Conversion Result Store Register0            */
  __I  uint32_t REG01;             /*!< Conversion Result Store Register1            */
  __I  uint32_t REG02;             /*!< Conversion Result Store Register2            */
  __I  uint32_t REG03;             /*!< Conversion Result Store Register3            */
  __I  uint32_t REG04;             /*!< Conversion Result Store Register4            */
  __I  uint32_t REG05;             /*!< Conversion Result Store Register5            */
  __I  uint32_t REG06;             /*!< Conversion Result Store Register6            */
  __I  uint32_t REG07;             /*!< Conversion Result Store Register7            */
       uint32_t RESERVED1[8];
  __I  uint32_t REGSP;             /*!< Highest Priority Conversion Result Store Register*/
} TSB_AD_TypeDef;

/**
  * @brief External Bus Interface(EXB)
  */
typedef struct
{
  __IO uint32_t MOD;               /*!< External Bus Mode Control Register           */
       uint32_t RESERVED0[3];
  __IO uint32_t AS0;               /*!< External Bus Base Address and CS Space setting Register 0*/
  __IO uint32_t AS1;               /*!< External Bus Base Address and CS Space setting Register 1 */
  __IO uint32_t AS2;               /*!< External Bus Base Address and CS Space setting Register 2*/
  __IO uint32_t AS3;               /*!< External Bus Base Address and CS Space setting Register 3*/
       uint32_t RESERVED1[8];
  __IO uint32_t CS0;               /*!< Chip Select and Wait Controller Register 0   */
  __IO uint32_t CS1;               /*!< Chip Select and Wait Controller Register 1   */
  __IO uint32_t CS2;               /*!< Chip Select and Wait Controller Register 2   */
  __IO uint32_t CS3;               /*!< Chip Select and Wait Controller Register 3   */
} TSB_EXB_TypeDef;

/**
  * @brief SNFC (SLC NAND Flash Controller) 
  */
typedef struct
{
  __IO uint32_t ENC;               /*!< SNFC Enable Control Register                 */
  __IO uint32_t ECCMOD;            /*!< SNFC Ecc Mode Register                       */
  __IO uint32_t IE;                /*!< SNFC Interrupt Enable Register               */
       uint32_t RESERVED0;
  __IO uint32_t PS;                /*!< SNFC Page Size Register                      */
  __IO uint32_t PRCS;              /*!< SNFC Page Read Column Status Register        */
  __IO uint32_t S;                 /*!< SNFC Sector Register                         */
  __IO uint32_t SS;                /*!< SNFC Sector Status Register                  */
  __IO uint32_t DIC;               /*!< SNFC Decode Input Count Register             */
  __IO uint32_t DOC;               /*!< SNFC Decode Output Count Register            */
  __IO uint32_t EIC;               /*!< SNFC Encode Input Count Register             */
       uint32_t RESERVED1;
  __IO uint32_t A1;                /*!< SNFC Address Register 1                      */
  __IO uint32_t A2;                /*!< SNFC Address Register 2                      */
  __IO uint32_t W;                 /*!< SNFC Write Register                          */
  __IO uint32_t BIC;               /*!< SNFC Bus Interface Control Register          */
  __IO uint32_t CS1;               /*!< SNFC Command Sequence Register 1             */
  __IO uint32_t CS2;               /*!< SNFC Command Sequence Register 2             */
  __IO uint32_t CS3;               /*!< SNFC Command Sequence Register 3             */
  __IO uint32_t CS4;               /*!< SNFC Command Sequence Register 4             */
  __IO uint32_t CSE;               /*!< SNFC Command Sequence Enable Register        */
       uint32_t RESERVED2[43];
  __I  uint32_t PRDB;              /*!< SNFC Page Read Buffer Registerer             */
  __I  uint32_t IR1;               /*!< SNFC Id Read Register 1                      */
  __I  uint32_t IR2;               /*!< SNFC Id Read Register 2                      */
       uint32_t RESERVED3;
  __I  uint32_t EP1;               /*!< SNFC Ecc Parity Register 1                   */
  __I  uint32_t EP2;               /*!< SNFC Ecc Parity Register 2                   */
  __I  uint32_t EP3;               /*!< SNFC Ecc Parity Register 3                   */
  __I  uint32_t EP4;               /*!< SNFC Ecc Parity Register 4                   */
  __I  uint32_t EC;                /*!< SNFC Ecc Crc Register                        */
       uint32_t RESERVED4[183];
  __IO uint32_t EWRB;              /*!< SNFC Ecc Write Buffer Register               */
       uint32_t RESERVED5[255];
  __I  uint32_t CDRB;              /*!< SNFC Correction Data Read Buffer Register    */
  __I  uint32_t EOC;               /*!< SNFC Ecc Output Control Register             */
  __I  uint32_t EBS;               /*!< SNFC Ecc Busy Status Register                */
       uint32_t RESERVED6[5];
  __I  uint32_t EES;               /*!< SNFC Ecc Error Status Register               */
       uint32_t RESERVED7[7];
  __I  uint32_t EDS1;              /*!< SNFC Ecc Decode State Register 1             */
  __I  uint32_t EDS2;              /*!< SNFC Ecc Decode State Register 2             */
  __I  uint32_t EDS3;              /*!< SNFC Ecc Decode State Register 3             */
  __I  uint32_t EDS4;              /*!< SNFC Ecc Decode State Register 4             */
  __I  uint32_t EDS5;              /*!< SNFC Ecc Decode State Register 5             */
  __I  uint32_t EDS6;              /*!< SNFC Ecc Decode State Register 6             */
  __I  uint32_t EDS7;              /*!< SNFC Ecc Decode State Register 7             */
  __I  uint32_t EDS8;              /*!< SNFC Ecc Decode State Register 8             */
       uint32_t RESERVED8[8];
  __I  uint32_t S1EE1PI;           /*!< SNFC Sector 1 Ecc Error 1  Positional Information Register*/
  __I  uint32_t S1EE2PI;           /*!< SNFC Sector 1 Ecc Error 2  Positional Information Register*/
  __I  uint32_t S1EE3PI;           /*!< SNFC Sector 1 Ecc Error 3  Positional Information Register*/
  __I  uint32_t S1EE4PI;           /*!< SNFC Sector 1 Ecc Error 4  Positional Information Register*/
  __I  uint32_t S2EE1PI;           /*!< SNFC Sector 2 Ecc Error 1  Positional Information Register*/
  __I  uint32_t S2EE2PI;           /*!< SNFC Sector 2 Ecc Error 2  Positional Information Register*/
  __I  uint32_t S2EE3PI;           /*!< SNFC Sector 2 Ecc Error 3  Positional Information Register*/
  __I  uint32_t S2EE4PI;           /*!< SNFC Sector 2 Ecc Error 4  Positional Information Register*/
  __I  uint32_t S3EE1PI;           /*!< SNFC Sector 3 Ecc Error 1  Positional Information Register*/
  __I  uint32_t S3EE2PI;           /*!< SNFC Sector 3 Ecc Error 2  Positional Information Register*/
  __I  uint32_t S3EE3PI;           /*!< SNFC Sector 3 Ecc Error 3  Positional Information Register*/
  __I  uint32_t S3EE4PI;           /*!< SNFC Sector 3 Ecc Error 4  Positional Information Register*/
  __I  uint32_t S4EE1PI;           /*!< SNFC Sector 4 Ecc Error 1  Positional Information Register*/
  __I  uint32_t S4EE2PI;           /*!< SNFC Sector 4 Ecc Error 2  Positional Information Register*/
  __I  uint32_t S4EE3PI;           /*!< SNFC Sector 4 Ecc Error 3  Positional Information Register*/
  __I  uint32_t S4EE4PI;           /*!< SNFC Sector 4 Ecc Error 4  Positional Information Register*/
  __I  uint32_t S5EE1PI;           /*!< SNFC Sector 5 Ecc Error 1  Positional Information Register*/
  __I  uint32_t S5EE2PI;           /*!< SNFC Sector 5 Ecc Error 2  Positional Information Register*/
  __I  uint32_t S5EE3PI;           /*!< SNFC Sector 5 Ecc Error 3  Positional Information Register*/
  __I  uint32_t S5EE4PI;           /*!< SNFC Sector 5 Ecc Error 4  Positional Information Register*/
  __I  uint32_t S6EE1PI;           /*!< SNFC Sector 6 Ecc Error 1  Positional Information Register*/
  __I  uint32_t S6EE2PI;           /*!< SNFC Sector 6 Ecc Error 2  Positional Information Register*/
  __I  uint32_t S6EE3PI;           /*!< SNFC Sector 6 Ecc Error 3  Positional Information Register*/
  __I  uint32_t S6EE4PI;           /*!< SNFC Sector 6 Ecc Error 4  Positional Information Register*/
  __I  uint32_t S7EE1PI;           /*!< SNFC Sector 7 Ecc Error 1  Positional Information Register*/
  __I  uint32_t S7EE2PI;           /*!< SNFC Sector 7 Ecc Error 2  Positional Information Register*/
  __I  uint32_t S7EE3PI;           /*!< SNFC Sector 7 Ecc Error 3  Positional Information Register*/
  __I  uint32_t S7EE4PI;           /*!< SNFC Sector 7 Ecc Error 4  Positional Information Register*/
  __I  uint32_t S8EE1PI;           /*!< SNFC Sector 8 Ecc Error 1  Positional Information Register*/
  __I  uint32_t S8EE2PI;           /*!< SNFC Sector 8 Ecc Error 2  Positional Information Register*/
  __I  uint32_t S8EE3PI;           /*!< SNFC Sector 8 Ecc Error 3  Positional Information Register*/
  __I  uint32_t S8EE4PI;           /*!< SNFC Sector 8 Ecc Error 4  Positional Information Register*/
} TSB_SNFC_TypeDef;

/**
  * @brief DMA Interrupt Flag
  */
typedef struct
{
  __I  uint32_t FLGA;              /*!< DMA Flag Register A                          */
  __I  uint32_t FLGB;              /*!< DMA Flag Register B                          */
  __I  uint32_t FLGC;              /*!< DMA Flag Register C                          */
} TSB_DMAIF_TypeDef;

/**
  * @brief ADC infterface Register
  */
typedef struct
{
       uint32_t RESERVED0[4];
  __IO uint32_t TRGSEL;            /*!< Trigger Selection Register                   */
} TSB_ADILV_TypeDef;

/**
  * @brief I2C Bus Interface (I2C)
  */
typedef struct
{
  __IO uint32_t CR1;               /*!< I2C Control Register 1                       */
  __IO uint32_t DBR;               /*!< Data Buffer Register                         */
  __IO uint32_t AR;                /*!< Bus address Register                         */
union {
  __O  uint32_t CR2;               /*!<  Control Register 1                          */
  __I  uint32_t SR;                /*!< Status Register                              */
  };
  __IO uint32_t PRS;               /*!< Prescaler clcok setting Register             */
  __IO uint32_t IE;                /*!< Interrupt Enable Register                    */
  __IO uint32_t IR;                /*!< Interrupt Register                           */
} TSB_I2C_TypeDef;

/**
  * @brief Advanced Encryption Standard (AES)
  */
typedef struct
{
  __O  uint32_t DT;                /*!< Plaintext/encrypted text data Register       */
  __IO uint32_t KEY7;              /*!< Input Key Data Register (bit 31 - 0)         */
  __IO uint32_t KEY6;              /*!< Input Key Data Register (bit 63 - 32)        */
  __IO uint32_t KEY5;              /*!< Input Key Data Register (bit 95 - 64)        */
  __IO uint32_t KEY4;              /*!< Input Key Data Register (bit 127 - 96)       */
  __IO uint32_t KEY3;              /*!< Input Key Data Register (bit 159 - 128)      */
  __IO uint32_t KEY2;              /*!< Input Key Data Register (bit 191 - 160)      */
  __IO uint32_t KEY1;              /*!< Input Key Data Register (bit 223 - 192)      */
  __IO uint32_t KEY0;              /*!< Input Key Data Register (bit 255 - 224)      */
  __IO uint32_t CNT3;              /*!< Counter Initial Value Register (bit 31 - 0)  */
  __IO uint32_t CNT2;              /*!< Counter Initial Value Register (bit 63 - 32) */
  __IO uint32_t CNT1;              /*!< Counter Initial Value Register (bit 95 - 64) */
  __IO uint32_t CNT0;              /*!< Counter Initial Value Register (bit 127 - 96)*/
  __IO uint32_t IV3;               /*!< Initial Vector Register (bit 31 - 0)         */
  __IO uint32_t IV2;               /*!< Initial Vector Register (bit 63 - 32)        */
  __IO uint32_t IV1;               /*!< Initial Vector Register (bit 95 - 64)        */
  __IO uint32_t IV0;               /*!< Initial Vector Register (bit 127 - 96)       */
  __I  uint32_t ODT;               /*!< Calculation Result Store Register            */
  __I  uint32_t RKEY7;             /*!< Output Key Store Register (bit 31 - 0)       */
  __I  uint32_t RKEY6;             /*!< Output Key Store Register (bit 63 - 32)      */
  __I  uint32_t RKEY5;             /*!< Output Key Store Register (bit 95 - 64)      */
  __I  uint32_t RKEY4;             /*!< Output Key Store Register (bit 127 - 96)     */
  __I  uint32_t RKEY3;             /*!< Output Key Store Register (bit 159 - 128)    */
  __I  uint32_t RKEY2;             /*!< Output Key Store Register (bit 191 - 160)    */
  __I  uint32_t RKEY1;             /*!< Output Key Store Register (bit 223 - 192)    */
  __I  uint32_t RKEY0;             /*!< Output Key Store Register (bit 255 - 224)    */
  __O  uint32_t CLR;               /*!< FIFO Clear Register                          */
  __IO uint32_t MOD;               /*!< Mode Setting Register                        */
  __I  uint32_t STATUS;            /*!< Status Register                              */
} TSB_AES_TypeDef;

/**
  * @brief Secure Hash Algorithm Processor (SHA)
  */
typedef struct
{
  __O  uint32_t START;             /*!< Process Start Register                       */
  __IO uint32_t CR;                /*!< Control Register                             */
  __IO uint32_t DMAEN;             /*!< DMA Enable Register                          */
  __IO uint32_t MSGLEN0;           /*!< Whole Message Length Register (bit 31 - 0)   */
  __IO uint32_t MSGLEN1;           /*!< Whole Message Length Register (bit 60 - 32)  */
  __IO uint32_t REMAIN0;           /*!< Unhandled Message Length Register (bit 31 - 0)*/
  __IO uint32_t REMAIN1;           /*!< Unhandled Message Length Register (bit 60 - 32)*/
  __IO uint32_t MSG00;             /*!< Message Register (bit 31 - 0)                */
  __IO uint32_t MSG01;             /*!< Message Register (bit 63 - 32)               */
  __IO uint32_t MSG02;             /*!< Message Register (bit 95 - 64)               */
  __IO uint32_t MSG03;             /*!< Message Register (bit 127 - 96)              */
  __IO uint32_t MSG04;             /*!< Message Register (bit 159 - 128)             */
  __IO uint32_t MSG05;             /*!< Message Register (bit 191 - 160)             */
  __IO uint32_t MSG06;             /*!< Message Register (bit 223 - 192)             */
  __IO uint32_t MSG07;             /*!< Message Register (bit 255 - 224)             */
  __IO uint32_t MSG08;             /*!< Message Register (bit 287 - 256)             */
  __IO uint32_t MSG09;             /*!< Message Register (bit 319 - 288)             */
  __IO uint32_t MSG10;             /*!< Message Register (bit 351 - 320)             */
  __IO uint32_t MSG11;             /*!< Message Register (bit 383 - 352)             */
  __IO uint32_t MSG12;             /*!< Message Register (bit 415 - 384)             */
  __IO uint32_t MSG13;             /*!< Message Register (bit 447 - 416)             */
  __IO uint32_t MSG14;             /*!< Message Register (bit 479 - 448)             */
  __IO uint32_t MSG15;             /*!< Message Register (bit 511 - 480)             */
  __IO uint32_t INIT0;             /*!< Hash Initial Value Register (bit 31 - 0)     */
  __IO uint32_t INIT1;             /*!< Hash Initial Value Register (bit 63 - 32)    */
  __IO uint32_t INIT2;             /*!< Hash Initial Value Register (bit 95 - 64)    */
  __IO uint32_t INIT3;             /*!< Hash Initial Value Register (bit 127 - 96)   */
  __IO uint32_t INIT4;             /*!< Hash Initial Value Register (bit 159 - 128)  */
  __IO uint32_t INIT5;             /*!< Hash Initial Value Register (bit 191 - 160)  */
  __IO uint32_t INIT6;             /*!< Hash Initial Value Register (bit 223 - 192)  */
  __IO uint32_t INIT7;             /*!< Hash Initial Value Register (bit 255 - 224)  */
  __I  uint32_t RESULT0;           /*!< Calculation Result Register (bit 31 - 0)     */
  __I  uint32_t RESULT1;           /*!< Calculation Result Register (bit 63 - 32)    */
  __I  uint32_t RESULT2;           /*!< Calculation Result Register (bit 95 - 64)    */
  __I  uint32_t RESULT3;           /*!< Calculation Result Register (bit 127 - 96)   */
  __I  uint32_t RESULT4;           /*!< Calculation Result Register (bit 159 - 128)  */
  __I  uint32_t RESULT5;           /*!< Calculation Result Register (bit 191 - 160)  */
  __I  uint32_t RESULT6;           /*!< Calculation Result Register (bit 223 - 192)  */
  __I  uint32_t RESULT7;           /*!< Calculation Result Register (bit 255 - 224)  */
  __I  uint32_t STATUS;            /*!< Status Register                              */
} TSB_SHA_TypeDef;

